app/views/articles/show.html.erb


<% @article.comments.each do |comment| %>
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`article_id` = 980190962