app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO `articles` (`title`, `post`, `user_id`, `created_at`, `updated_at`) VALUES ('MyString', 'MyText', 1, '2016-02-24 04:59:07', '2016-02-24 04:59:07')

  def destroy
    @article.destroy
---
DELETE FROM `articles` WHERE `articles`.`id` = 980190962

    def set_article
      @article = Article.find(params[:id])
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 980190962 LIMIT 1