app/controllers/collections_controller.rb

  def index
    @collections = Collection.all
---
SELECT `collections`.* FROM `collections`

  def create
    @collection = Collection.new(collection_params)

    respond_to do |format|
      if @collection.save
---
INSERT INTO `collections` (`title`, `ownerid`, `description`, `created_at`, `updated_at`) VALUES ('MyString', 1, 'MyText', '2016-02-29 00:06:22', '2016-02-29 00:06:22')

  def destroy
    @collection.destroy
---
DELETE FROM `collections` WHERE `collections`.`id` = 980190962

    def set_collection
      @collection = Collection.find(params[:id])
---
SELECT  `collections`.* FROM `collections` WHERE `collections`.`id` = 980190962 LIMIT 1