app/controllers/subcomponents_controller.rb

SELECT `subcomponents`.* FROM `subcomponents` WHERE (owner_id = NULL)
---
  def index

    @subcomponents = Subcomponent.all #where("owner_id = ?", params[:userid])

INSERT INTO `subcomponents` (`behaviour`, `refid`, `ownerid`, `editorid`, `followerid`, `views`, `viewable`, `active`, `title`, `subs`, `description`, `titleimage`, `meat`, `created_at`, `updated_at`) VALUES ('MyString', 'MyString', 1, 'MyString', 'MyString', 1, 0, 0, 'MyString', 'MyText', 'MyText', 'MyString', 'MyText', '2016-02-29 00:06:26', '2016-02-29 00:06:26')
---
  def create
    @subcomponent = Subcomponent.new(subcomponent_params)

    respond_to do |format|
      if @subcomponent.save

DELETE FROM `subcomponents` WHERE `subcomponents`.`id` = 980190962
---
  def destroy
    @subcomponent.destroy

SELECT  `subcomponents`.* FROM `subcomponents` WHERE `subcomponents`.`id` = 980190962 LIMIT 1
---
    def set_subcomponent
      @subcomponent = Subcomponent.find(params[:id])