app/controllers/users_controller.rb

INSERT INTO `users` (`username`, `email`, `password`, `salt`, `refid`, `active`, `follows`, `text`, `tagline`, `status`, `userimage`, `titleimage`, `created_at`, `updated_at`) VALUES ('MyString', 'MyString', 'MyString', 'MyString', 'MyString', 1, 'MyString', 'MyString', 'MyString', 'MyText', 'MyString', 'MyString', '2016-02-29 00:31:46', '2016-02-29 00:31:46')
---
  def create
    @user = User.new(user_params)
    respond_to do |format|
      if @user.save